Revit 2026 API

# ValueParsingOptionsSetFormatOptions Method

---

Sets the FormatOptions to optionally override the default settings in the Units class.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetFormatOptions(
	FormatOptions formatOptions
)
```
```vb
Public Sub SetFormatOptions (
	formatOptions As FormatOptions
)
```
```cpp
public:
void SetFormatOptions(
	FormatOptions^ formatOptions
)
```
```fsharp
member SetFormatOptions :
        formatOptions : FormatOptions -> unit
```

#### Parameters

formatOptions FormatOptions
     The FormatOptions.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

By default, the FormatOptions represents default formatting (UseDefault is true) and the FormatOptions in the Units class will be used.

#### Reference

ValueParsingOptions Class

Autodesk.Revit.DB Namespace